# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Time    : 2024/11/12 15:42
# @Author  : wangchongshi
# @Email   : wangchongshi.wcs@antgroup.com
# @FileName: prod_description.py

# mock的特定背景知识，用于回答宠物医保升级相关问题。
PROD_DESCRIPTION_A = """
宠物医保在保障期间暂不支持升级。宠物医保有基础版、升级版、尊享版三个版本，投保某一版本后不支持升级为别的版本。
如果您希望享受更高级别的保障，可以在当前保险期结束后，重新选择更高版本的宠物医保进行投保。例如，从基础版升级到升级版或尊享版。

宠物医保
1、保险产品：
    "宠物医保"（以下简称"商险"）保障期限12个月，是付费版商业险，有三个保障：基础版、升级版、尊享版。
2、投/被保险人：
    在中华人民共和国境内（不包括港、澳、台地区），饲养或受他人委托临时代为饲养（以下统称"饲养"）宠物的年满16周岁的具备完全民事行为的个人，可作为本保险的投被保险人。
3、被保险宠物：
    本保险合同承保的宠物（以下简称"被保险宠物"）为被保险人以玩赏、陪伴为目的而合法饲养的、可明确鉴别身份的年龄为60天-10周岁的犬类或猫类宠物。
4、保险期限：
    "商险"：自投保申请核保通过后次日零时生效，保险期间12个月（具体以保单载明的起讫时间为准）。
5、"商险"保障责任：
    用于报销猫、狗宠物因常见疾病、意外事故而导致的医疗费用。先天、遗传性疾病不在本产品保障范围内。具体责任上，分为三个保障方案：基础版、升级版、尊享版，具体方案如下：
        1. 保障总额：基础版10000元，升级版20000元，尊享版30000元
        2. 免赔额：基础版、升级版、尊享版均一样，门诊0元，手术0元
        3. 报销比例: 定点医院70%（若上一年未发生理赔，赔付比例上调10%，最高可达90%），非定点医院40%（若上一年未发生理赔，赔付比例上调10%，最高可达90%）
        4. 单次事故赔付上限：1）基础版：门诊500元，手术1000元；2）升级版：门诊1200元，手术2000元；3）尊享版：门诊2000元，手术3000元
        5. 等待期: 首次或非连续投保本保险时，意外医疗保险责任10天，肿瘤和口腔疾病60天，其他疾病30天。
        6. 保障详情：在保险期间内，被保险人饲养的、在本合同中载明的被保险宠物在等待期届满后遭受意外伤害事故或罹患疾病，因此在本合同中载明的宠物医疗机构接受本合同载明的医疗项目治疗的，对于被保险人支付的必要的、合理的医疗费用，保险人按照本合同的约定负责赔偿。保险期满时，被保险宠物仍然需要接受治疗的，保险人根据本合同的约定继续承担保险责任，最长截至保险期满之日起第30日止。        
6、增值服务：
    增值服务是本产品赠送的高价值宠物健康服务。具体包括包括以下服务：
        1）基础版：邮寄体外驱虫药1支；电话问诊咨询；每月200元消费额度。
        2）升级版：邮寄体外驱虫药1支；电话问诊咨询；犬多联/猫三联疫苗一针；每月200元消费额度。
        3）尊享版：邮寄体外驱虫药1支；电话问诊咨询；犬多联/猫三联疫苗一针；狂犬疫苗1针；全面体检1次（含粪检、血常规）；每月200元消费额度。
"""