# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Time    : 2024/11/12 15:42
# @Author  : wangchongshi
# @Email   : wangchongshi.wcs@antgroup.com
# @FileName: prod_description.py

PROD_A_DESCRIPTION = """
宠物医保（体验版）
1、保险产品：
    "宠物医保（体验版）"（以下简称"赠险"）免费体验30天，到期后会自动承接付费版"宠物医保"（以下简称"商险"），商险保障期12个月。
2、投/被保险人：
    在中华人民共和国境内（不包括港、澳、台地区），饲养或受他人委托临时代为饲养（以下统称"饲养"）宠物的年满16周岁的具备完全民事行为的个人，可作为本保险的投被保险人。
3、被保险宠物：
    本保险合同承保的宠物（以下简称"被保险宠物"）为被保险人以玩赏、陪伴为目的而合法饲养的、可明确鉴别身份的年龄为60天-10周岁的犬类或猫类宠物。
4、保险期限：
    "赠险"：自投保申请核保通过后次日零时生效，保险期间30天（具体以保单载明的起讫时间为准），若被保险宠物年龄不满足60天也可进行领取并约定保险生效日期（约定的保险起讫时间将在保单中载明），等待期从生效之日起算；
    "商险"：自投保申请核保通过后，于30天后（或者"赠险"保险期间结束后）的次日零时生效，保险期间12个月（具体以保单载明的起讫时间为准）。
5、"赠险"保障责任： 
    用于报销猫、狗宠物因常见疾病、意外事故而导致的医疗费用。先天、遗传性疾病不在本产品保障范围内。具体保障方案如下：
        1. 保障总额：20000元
        2. 免赔额：门诊0元，手术0元
        3. 报销比例: 定点医院70%（若上一年未发生理赔，赔付比例上调10%，最高可达90%），非定点医院40%（若上一年未发生理赔，赔付比例上调10%，最高可达60%）
        4. 单次事故赔付上限：门诊1200元，手术2000元
        5. 等待期: 意外医疗保险责任10天，肿瘤和口腔疾病60天，其他疾病30天。
        6. 保障详情：在保险期间内，被保险人饲养的、在本保险合同中载明的被保险宠物在等待期届满后遭受意外伤害事故或罹患疾病，因此在本保险合同中载明的宠物医疗机构接受本保险合同载明的医疗项目治疗的，对于被保险人支付的必要的、合理的医疗费用，保险人按照本合同的约定负责赔偿。被保险宠物在保险期间内接受上述治疗，本合同保险期间届满时，被保险宠物未结束本次治疗的，保险人根据本保险合同约定继续承担保险责任，延长保险责任期间由投保人与保险人协商确定，但最长不超过30天，并在本保险合同中载明。
6、增值服务：
    "赠险"可享受每月200元消费额度（本折扣额度非现金，为权益抵扣价值），在蚂蚁宠物商城买药、买服务可享优惠。体验30天到期转付费版商险可额外再享受三项增值服务：犬多联/猫三联疫苗一针、体外驱虫一支、宠物医师电话咨询。
7、缴费方式及金额：
    30天的"赠险"产品属于赠送福利，免费体验，无需缴纳保险费。
    本产品保障期满会自动承接"商险"，有月缴和年缴两种缴费方式，可根据需求自行选择：
        a. 月缴：猫类月保费为34.08元，犬类月保费为37.5元。总共12期，首期扣款时间为前序"赠险"30天保障期结束的前10天（含终止日）。剩余11期的扣款日，是每月的"商险"保单生效日，如果当月该天不存在，就提前到当月的最后一天。举例，"赠险"是2024年1月29号保障期终止，那么后续"商险"的月缴首期扣款日是2024年1月20号，"商险"是2024年1月30号生效，第二期扣款日是2024年2月29号（因为当月30号不存在），第三期扣款日是2024年3月30号，以此类推。
        b. 年缴：猫类年保费为409元，犬类年保费为450元，一次性为12个月的"商险"全额缴费。扣款时间为前序"赠险"30天保障期结束的前10天（含终止日）。举例，"赠险"是2024年1月29号保障期终止，那么后续"商险"的年缴扣款日是2024年1月20号。
8、产品犹豫期：
本产品无犹豫期。
9、续保规则：
    赠险不存在续保的情况，赠险保障期限30天，保障到期自动承接商险。
    商险续保规则如下：
        1. 不保证续保。
        2. 您在本年度投保时选择了开通下一年延续保障（以下简称"续保"）服务并同意相关服务协议，或在该保单到期前30天内或到期后15天内为同一被保险人重新申请投保的，经保险人审核同意后缴纳保费，重新获得新的保险合同，续保时会根据上一年度风险重新厘定具体缴纳保费以保单展示为准、保障范围以重新出具的保单约定及对应投保须知内容为准。
        3. 本年度未出险的，续保保单赔付比例提高10%（定点医院最高赔付比例为90%，非定点医院最高赔付比例为60%）；若续保保单出险，第三年经保险人审核同意续保的，定点医院赔付比例恢复到70%，非定点医院赔付比例恢复到40%。
10、产品合同解除（退保）规则：
    赠险期间可以随时取消或退保，可以在【蚂蚁保】-【我的】-【全部保单】中找到对应保单进行操作，退还保费为0元。
    "赠险"生效后，免费体验期为30天，到期后会自动承接至付费版"商险"，"商险"退保规则如下：
        1. 保单未生效：保单未生效申请退保，将全额退还已缴纳的保险费；
        2. 保单已生效：
          a. 年缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：未满期保险费=保险费×(1- 保险单已经过天数/保险期间天数)。
          b. 月缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：退还未满期保险费=本合同当期月度保险费×(1-当月实际经过天数/当月实际天数）。
"""

PROD_B_DESCRIPTION = """
宠物医保
1、保险产品：
    "宠物医保"（以下简称"商险"）保障期限12个月，是付费版商业险，有三个保障：基础版、升级版、尊享版。
2、投/被保险人：
    在中华人民共和国境内（不包括港、澳、台地区），饲养或受他人委托临时代为饲养（以下统称"饲养"）宠物的年满16周岁的具备完全民事行为的个人，可作为本保险的投被保险人。
3、被保险宠物：
    本保险合同承保的宠物（以下简称"被保险宠物"）为被保险人以玩赏、陪伴为目的而合法饲养的、可明确鉴别身份的年龄为60天-10周岁的犬类或猫类宠物。
4、保险期限：
    "商险"：自投保申请核保通过后次日零时生效，保险期间12个月（具体以保单载明的起讫时间为准）。
5、"商险"保障责任：
    用于报销猫、狗宠物因常见疾病、意外事故而导致的医疗费用。先天、遗传性疾病不在本产品保障范围内。具体责任上，分为三个保障方案：基础版、升级版、尊享版，具体方案如下：
        1. 保障总额：基础版10000元，升级版20000元，尊享版30000元
        2. 免赔额：基础版、升级版、尊享版均一样，门诊0元，手术0元
        3. 报销比例: 定点医院70%（若上一年未发生理赔，赔付比例上调10%，最高可达90%），非定点医院40%（若上一年未发生理赔，赔付比例上调10%，最高可达90%）
        4. 单次事故赔付上限：1）基础版：门诊500元，手术1000元；2）升级版：门诊1200元，手术2000元；3）尊享版：门诊2000元，手术3000元
        5. 等待期: 首次或非连续投保本保险时，意外医疗保险责任10天，肿瘤和口腔疾病60天，其他疾病30天。
        6. 保障详情：在保险期间内，被保险人饲养的、在本合同中载明的被保险宠物在等待期届满后遭受意外伤害事故或罹患疾病，因此在本合同中载明的宠物医疗机构接受本合同载明的医疗项目治疗的，对于被保险人支付的必要的、合理的医疗费用，保险人按照本合同的约定负责赔偿。保险期满时，被保险宠物仍然需要接受治疗的，保险人根据本合同的约定继续承担保险责任，最长截至保险期满之日起第30日止。        
6、增值服务：
    增值服务是本产品赠送的高价值宠物健康服务。具体包括包括以下服务：
        1）基础版：邮寄体外驱虫药1支；电话问诊咨询；每月200元消费额度。
        2）升级版：邮寄体外驱虫药1支；电话问诊咨询；犬多联/猫三联疫苗一针；每月200元消费额度。
        3）尊享版：邮寄体外驱虫药1支；电话问诊咨询；犬多联/猫三联疫苗一针；狂犬疫苗1针；全面体检1次（含粪检、血常规）；每月200元消费额度。
7、缴费方式及金额：
    本保险方案有月缴和年缴两种缴费方式，可根据需求自行选择：
        a. 月缴：基础版，猫类月保费为17.33元，犬类月保费为21.58元；升级版，猫类月保费为34.08元，犬类月保费为37.5元；尊享版，猫类月保费67.08元，犬类月保费73元。总共12期，首期付款时间为投保当日。剩余11期的扣款日，是每月的"商险"保单生效日，如果当月该天不存在，就提前到当月的最后一天。举例，被保人2024年1月29号投保"商险"并选择月缴方式，则当天2024年1月29号进行首期付款，"商险"于次日2024年1月30号生效，第二期扣款日是2024年2月29号（因为当月30号不存在），第三期扣款日是2024年3月30号，以此类推。
        b. 年缴：基础版，猫类年保费为208元，犬类年保费为259元；升级版，猫类年保费为409元，犬类年保费为450元；尊享版，猫类年保费805元，犬类年保费876元。需要在投保当日一次性全额扣款。
8、产品犹豫期：
本产品无犹豫期。
9、续保规则：
    商险是不保证续保的。
    您在本年度投保时选择了开通下一年延续保障（以下简称"续保"）服务并同意相关服务协议，或在该保单到期前30天内或到期后15天内为同一被保险人重新申请投保的，经保险人审核同意后缴纳保费，重新获得新的保险合同，续保时会根据上一年度风险重新厘定具体缴纳保费以保单展示为准、保障范围以重新出具的保单约定及对应投保须知内容为准。
    本年度未出险的，续保保单赔付比例提高10%（定点医院最高赔付比例为90%，非定点医院最高赔付比例为60%）；若续保保单出险，第三年经保险人审核同意续保的，定点医院赔付比例恢复到70%，非定点医院赔付比例恢复到40%。
10、产品合同解除（退保）规则：
    1. 保单未生效：保单未生效申请退保，将全额退还已缴纳的保险费；
    2. 保单已生效：
        a. 年缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：未满期保险费=保险费×(1- 保险单已经过天数/保险期间天数)。
        b. 月缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：退还未满期保险费=本合同当期月度保险费×(1-当月实际经过天数/当月实际天数）。
"""
