# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Time    : 2024/11/12 15:42
# @Author  : wangchongshi
# @Email   : wangchongshi.wcs@antgroup.com
# @FileName: prod_description.py

PROD_A_DESCRIPTION = """
保险产品A
1. 保险产品名称
产品名称：保险产品A
2. 投/被保险人
投保人资格：年满18岁至60岁的自然人。
被保险人范围：投保人本人或其直系亲属（配偶、子女、父母）。
3. 保险期限
保险期间：一年期，自保单生效日起算。
4. "赠险"保障责任
赠送保障内容：若被保险人在保险期间内首次确诊患有重大疾病，则额外获得一次性的健康关怀金人民币5万元。
适用条件：仅限于初次诊断为本合同所定义的重大疾病之一，并且该病症发生在保险有效期内。
5. 增值服务
紧急救援服务：包括但不限于24小时医疗咨询热线、国内外紧急医疗转运等。
健康管理服务：年度体检优惠券、在线医生咨询服务等。
6. 缴费方式及金额
缴费方式：支持一次性支付或按月分期支付。
保费标准：
一次性支付：成人每年1200元；儿童每年600元。
按月支付：成人每月100元；儿童每月50元。
7. 续保规则
自动续保选项：客户可以选择是否开启自动续保功能。如果开启了此功能，在每个保险年度结束前30天内未收到取消通知的情况下，系统将自动从指定账户扣取下一年度的保费以完成续保。
续保审核：对于选择不使用自动续保功能的客户，需要在当前保险期结束前向保险公司提出续保申请，并通过公司的审核后才能继续享受保障。
8. 产品合同解除（退保）规则
犹豫期内退保：购买后15天内为犹豫期，在此期间内如需退保，只需扣除不超过10元的成本费用即可全额退款。
正常退保：超过犹豫期后的任何时间点均可申请退保，但只能退还现金价值部分，具体数额根据已交纳保费总额以及剩余保险期限等因素计算得出。
"""

PROD_B_DESCRIPTION = """
保险产品B
1. 保险产品名称
产品全称：保险产品B
2. 投/被保险人资格
投保人资格：年满18周岁至60周岁的自然人。
被保险人资格：出生满30天至65周岁的自然人，且与投保人存在直系亲属关系或为本人。
3. 保险期限
基本期限：本合同的有效期为一年。
续保条件：满足续保要求时可自动续保，最长不超过70岁。
4. "赠险"保障责任
意外伤害医疗保险金：对于因意外事故导致的医疗费用，在扣除免赔额后按比例赔付，最高限额为人民币1万元。
紧急救援服务：提供全球范围内的紧急医疗转运服务一次。
5. 增值服务
健康管理咨询：每年享有两次免费的专业健康管理咨询服务。
在线医生问诊：不限次数地享受指定平台上的在线医生咨询服务。
6. 缴费方式及金额
缴费方式：支持一次性支付、分期付款两种模式。
保费标准：
年龄<30岁：￥800元/年
30≤年龄<45岁：￥1,200元/年
45≤年龄<60岁：￥1,500元/年
60≤年龄<65岁：￥2,000元/年
7. 续保规则
自动续保：如无特殊说明，本保险将于到期前一个月内自动发送续保通知，客户需确认是否继续投保。
调整费率：保险公司保留根据市场情况调整下一年度保费的权利。
8. 产品合同解除（退保）规则
犹豫期内退保：自收到保险单之日起15日内申请退保者，全额退还已缴纳保费。
犹豫期外退保：超过犹豫期后提出退保申请，则按照公司规定计算现金价值予以退还；若未满一个保单年度，则可能产生手续费损失。
"""