# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Time    : 2024/11/12 15:42
# @Author  : wangchongshi
# @Email   : wangchongshi.wcs@antgroup.com
# @FileName: prod_description.py

# mock的特定背景知识，用于回答宠物医保升级相关问题。
PROD_DESCRIPTION_A = """
保险产品A
1. 保险产品名称
产品名称：保险产品A
2. 投/被保险人
投保人资格：年满18岁至60岁的自然人。
被保险人范围：投保人本人或其直系亲属（配偶、子女、父母）。
3. 保险期限
保险期间：一年期，自保单生效日起算。
4. "赠险"保障责任
赠送保障内容：若被保险人在保险期间内首次确诊患有重大疾病，则额外获得一次性的健康关怀金人民币5万元。
适用条件：仅限于初次诊断为本合同所定义的重大疾病之一，并且该病症发生在保险有效期内。
5. 增值服务
紧急救援服务：包括但不限于24小时医疗咨询热线、国内外紧急医疗转运等。
健康管理服务：年度体检优惠券、在线医生咨询服务等。
6. 缴费方式及金额
缴费方式：支持一次性支付或按月分期支付。
保费标准：
一次性支付：成人每年1200元；儿童每年600元。
按月支付：成人每月100元；儿童每月50元。
7. 续保规则
自动续保选项：客户可以选择是否开启自动续保功能。如果开启了此功能，在每个保险年度结束前30天内未收到取消通知的情况下，系统将自动从指定账户扣取下一年度的保费以完成续保。
续保审核：对于选择不使用自动续保功能的客户，需要在当前保险期结束前向保险公司提出续保申请，并通过公司的审核后才能继续享受保障。
8. 产品合同解除（退保）规则
犹豫期内退保：购买后15天内为犹豫期，在此期间内如需退保，只需扣除不超过10元的成本费用即可全额退款。
正常退保：超过犹豫期后的任何时间点均可申请退保，但只能退还现金价值部分，具体数额根据已交纳保费总额以及剩余保险期限等因素计算得出。
"""